# pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
labels=['a','b','c']
my_data=[10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [9]:
pd.Series(data=my_data)  # index is assigned by pandas automaticly

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=my_data, index=labels) # we have assigned index

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(my_data,labels)  # we don't have to write data= or index=. The oreder is important

a    10
b    20
c    30
dtype: int64

In [14]:
# we have other ways to create a series
pd.Series(arr)  # we can use np array

0    10
1    20
2    30
dtype: int64

In [15]:
pd.Series(d)  # we can also use dic. here keyes are index and values are data

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(d,labels)

a    10
b    20
c    30
dtype: int64

In [18]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [23]:
# a series can hold any type of information. functions
pd.Series(data=[sum,len,min])   # attention to data and []

0    <built-in function sum>
1    <built-in function len>
2    <built-in function min>
dtype: object

In [28]:
ser1 = pd.Series([1,2,3,4],['usa','germany','turkey','japan'])

In [29]:
ser1   #. attention to type

usa        1
germany    2
turkey     3
japan      4
dtype: int64

In [30]:
ser2 = pd.Series(['usa','germany','turkey','japan'],[1,2,3,4])

In [31]:
ser2   # attention to type

1        usa
2    germany
3     turkey
4      japan
dtype: object

In [32]:
ser3 = pd.Series([1,2,5,4],['usa','germany','italy','japan'])

In [33]:
ser1+ser3   # the info which is not in both series is lost. italy and turkey is NAN

germany    4.0
italy      NaN
japan      8.0
turkey     NaN
usa        2.0
dtype: float64

##  DataFrames

In [38]:
from numpy.random import randn   # so we won't have to use np.random. everytime but just rand.

In [41]:
np.random.seed(101)   # this will give us same random numbers everytime

In [42]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z']) # data, rows labels, columns names

In [43]:
df  # a dataFrame is a bunch of series sharing same index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df['W']   # a column is a series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [48]:
type(df['W'])   # type of columns W is series

pandas.core.series.Series

In [49]:
type(df)

pandas.core.frame.DataFrame

In [63]:
# if you waant more columns use a list of columns
df[['X','W']]

          X         W
A  0.628133  2.706850
B -0.319318  0.651118
C  0.740122 -2.018168
D -0.758872  0.188695
E  1.978757  0.190794

In [66]:
df.loc['A',['X','Y']]

X    0.628133
Y    0.907969
Name: A, dtype: float64

In [82]:
df['new'] = (df['X'] + df ['Y']) * 100  # create a new column

In [84]:
df.drop('new', axis = 1)   # dropping a new column, just view

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df   # still there

          W         X         Y         Z         new
A  2.706850  0.628133  0.907969  0.503826  153.610216
B  0.651118 -0.319318 -0.848077  0.605965 -116.739503
C -2.018168  0.740122  0.528813 -0.589001  126.893555
D  0.188695 -0.758872 -0.933237  0.955057 -169.210927
E  0.190794  1.978757  2.605967  0.683509  458.472460

In [86]:
df.drop('new', axis = 1, inplace = True)   # dropping a new column

In [88]:
df # gone.  inplace is important

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
df.drop('E', axis = 0, inplace = True)

In [91]:
df   # E is dropped, here the axis is in deault 0 so don't have to write axies = 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [93]:
df.shape

(4, 4)

In [94]:
df.loc['A']   # a serie of row A

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [95]:
type(df.loc['A'])

pandas.core.series.Series

In [96]:
df.iloc[0]  # with integers strats from 0 instead of labels

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [102]:
df.loc[['A','B'],:]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [103]:
df.loc[['A','B'],['X','Y']]  # selecting rows and columns

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [105]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [137]:
df['Z']<0

A    False
B    False
C     True
D    False
Name: Z, dtype: bool

In [185]:
df[df['Z']<0]  # the whole row where value at column z is less than zero

               W         X         Y         Z
newind
OA     -2.018168  0.740122  0.528813 -0.589001

In [ ]:
df[df['W']>0]   # C is not there

In [140]:
df[df['W']>0]['X']    # we got the x column of selection

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [141]:
df[df['W']>0][['X','Y']]   # attention to brackets. x,y is a list

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237

In [144]:
# multiple conditions

df[(df['W']>0) and (df['Y']>0)]   # here "and"  does not work. because it can not od it with series

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [145]:
df[(df['W']>0) & (df['Y']>0)]   # should use "&"  for multiple conditions with series and dfs.

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [147]:
df[(df['W']>0) | (df['Y']>0)]     #  "|"   for   "or"

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [148]:
df.reset_index()   #. makes a new index. but not inplace. just view

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [149]:
df.reset_index(inplace = True)

In [150]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [156]:
df.set_index('index', inplace=True)

In [157]:
df

              W         X         Y         Z
index
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057

In [162]:
df['new'] = range(1,5)

In [164]:
df.set_index('new')

            W         X         Y         Z
new
1    2.706850  0.628133  0.907969  0.503826
2    0.651118 -0.319318 -0.848077  0.605965
3   -2.018168  0.740122  0.528813 -0.589001
4    0.188695 -0.758872 -0.933237  0.955057

In [165]:
df

              W         X         Y         Z  new
index
A      2.706850  0.628133  0.907969  0.503826    1
B      0.651118 -0.319318 -0.848077  0.605965    2
C     -2.018168  0.740122  0.528813 -0.589001    3
D      0.188695 -0.758872 -0.933237  0.955057    4

In [166]:
newind='CA NY OA LY'.split()  # a common method to make a list !!!

In [167]:
newind

['CA', 'NY', 'OA', 'LY']

In [168]:
df['newind'] = newind

In [175]:
df = df.set_index('newind').drop('new', axis=1)

In [184]:
df.rename_axis(index='state')    # change index name

              W         X         Y         Z
state
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
OA    -2.018168  0.740122  0.528813 -0.589001
LY     0.188695 -0.758872 -0.933237  0.955057

In [186]:
# index levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [187]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [188]:
inside

[1, 2, 3, 1, 2, 3]

In [190]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [191]:
hier_index   # multi index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [193]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [195]:
df #  a multi indexed Data Frame

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [196]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [205]:
df.loc[['G1'],['A','B']]

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528

In [210]:
df.loc['G1'].loc[1]    # G1 1. row

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [211]:
df.loc['G1'].loc[2]['B']  # G1 2.row B column

-1.1591194155484297

In [214]:
df.index.names=('groups','num')   # changing index names

In [215]:
df

                   A         B
groups num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [217]:
# xs  :  crossection func

df.xs(1, level='num')      #  num 1 of G1 and G2

               A         B
groups
G1      0.302665  1.693723
G2      0.166905  0.184502

##  fill nan

In [218]:
d = {'a':[1,2,np.nan],'b':[1,np.nan,np.nan],'c':[1,2,3]}

In [220]:
df = pd.DataFrame(d)

In [221]:
df

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [222]:
# drop value nan

df.dropna()    # with default arguments it drops all rows has any nan. default axis =0

     a    b  c
0  1.0  1.0  1

In [223]:
df.dropna(axis=1)   # drops all columns has any nan

   c
0  1
1  2
2  3

In [224]:
df.dropna(how='all')  # defalult axis=0 and drop rows of which all values are nan

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [230]:
df.dropna(thresh=2,)   # drops rows has more than 2 values. row 2 is dropped

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2

In [229]:
df.dropna(thresh=2,axis=1)   # drops columns has more than 2 values. column b is dropped

     a  c
0  1.0  1
1  2.0  2
2  NaN  3

In [231]:
df.fillna(value='0')  # instead of nan filled with 0

   a  b  c
0  1  1  1
1  2  0  2
2  0  0  3

In [232]:
df.loc[2].sum()

3.0

In [233]:
df   # because inplace is in default False

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [240]:
df['a'].fillna(value=df['a'].mean()) # we can fill nans with mean of column a

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [245]:
df.fillna(method='bfill')  # fills the columns from bottom to top with the last value below. here non of the filled

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [246]:
df.fillna(method='ffill')  # fills forward, from top to down. 2a is filled with 2.0, the last non nan value

     a    b  c
0  1.0  1.0  1
1  2.0  1.0  2
2  2.0  1.0  3

## groupby

In [251]:
data = {'Company':['GOOG','GOOG', 'MSFT','MSFT','FB','FB'], 'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'], 
        'Sales':[200,120,340,124,243,350]}

In [252]:
df = pd.DataFrame(data)

In [253]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [257]:
byCom=df.groupby('Company')

In [259]:
byCom.mean()    # pandas automatically ignores the non numeric columns. it calculated the mean of sales

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [260]:
byCom.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [268]:
byCom.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [275]:
# we can use them all in one line

df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [280]:
# describe and transpose funcs

df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [281]:
df.groupby('Company').describe().transpose()  # we can transpose the table

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [282]:
df.groupby('Company').describe().transpose()['FB'] # from data frame we can select a specisif data

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## merge join concat

In [293]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'], 
                    'B':['B0','B1','B2','B3'], 
                    'C':['C0','C1','C2','C3'], 
                    'D':['D1','D2','D3','D4']},
                  index=[0,1,2,3])

In [285]:
df1

    A   B   C   D
0  A0  B0  C0  D1
1  A1  B1  C1  D2
2  A2  B2  C2  D3
3  A3  B3  C3  D4

In [294]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'], 
                    'B':['B4','B5','B6','B7'], 
                    'C':['C4','C5','C6','C7'], 
                    'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [295]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [296]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'], 
                    'B':['B8','B9','B10','B11'], 
                    'C':['C8','C9','C10','C11'], 
                    'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [297]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [301]:
pd.concat([df1,df2,df3],axis=1)  # if the indexes were same the frame would be only 4 rows [0,1,2,3]

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### merge()

In [302]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [304]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [305]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [303]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [306]:
pd.merge(right,left)

  key   C   D   A   B
0  K0  C0  D0  A0  B0
1  K1  C1  D1  A1  B1
2  K2  C2  D2  A2  B2
3  K3  C3  D3  A3  B3

In [312]:
pd.merge(left,right, how='outer', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [313]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [315]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [316]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [322]:
pd.merge(left,right,how='outer')

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

### join()

In [323]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [324]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [325]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [326]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [328]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

##  operations

In [329]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [334]:
len(df['col2'].unique())

3

In [340]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [345]:
df[(df['col1']>1) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [346]:
def times(x):
    return x**2

In [354]:
df['col1'].apply(times)  ##  applies times func to evers row if it.

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [357]:
df[['col1','col2']].apply(times)

   col1    col2
0     1  197136
1     4  308025
2     9  443556
3    16  197136

In [358]:
df.col3.apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [362]:
len(df.col3)   # gives the length of the column

4

In [363]:
df.col3.apply(len)  # gives the length of every cell in the series

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [366]:
df.apply(len)  # length of df means the length of every column

col1    4
col2    4
col3    4
dtype: int64

In [370]:
df.col2.apply(lambda x: x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [373]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [374]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [375]:
df.sort_values('col2',axis=0)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [376]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [377]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [378]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [384]:
pd.pivot_table(df,values='D', index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [385]:
pd.pivot_table(df,values='D', index=['A','C'],columns='B')

B      one  two
A   C
bar x  4.0  NaN
    y  1.0  5.0
foo x  1.0  2.0
    y  3.0  NaN

##  data input and output

In [387]:
pwd

'/Users/Latif/Desktop/DATA SCIENCE/PYTHON DA - ML Jose'

In [398]:
data=pd.read_excel('62258,asm-listesi-20022019xlsx.xlsx', names=['Name','Adress','Province','Phone'])

In [400]:
data.head()

,Name,Adress,Province,Phone
0,Birinci Basamak Sağlık Kurumlarına Ait Bilgiler,NaN,NaN,NaN
1,Sağlık Kurumunun Adı,Adres,Bulunduğu İlçe,Telefon
2,1 Nolu Alacahırka ASM,Pınarbaşı Mh. Alacahırka Cd. No:58,Osmangazi,2222625
3,2 Nolu Çarşamba ASM,Çırpan Mh. Merinoslu Sk.,Osmangazi,2718828
4,3 Nolu Çekirge ASM,Çekirge Mh. Narlı Sokak No:6,Osmangazi,2347817

In [402]:
gr=data.groupby('Province')

In [412]:
gr.agg('all')

                  Name  Adress  Phone
Province
Bulunduğu İlçe    True    True   True
Büyükorhan        True    True   True
Gemlik            True    True   True
Gürsu             True    True   True
Harmancık         True    True   True
Karacabey         True    True   True
Kestel            True    True   True
Mudanya           True    True   True
Mustafakemalpaşa  True    True   True
Nilüfer           True    True   True
Orhaneli          True    True   True
Orhangazi         True    True   True
Osmangazi         True    True   True
Yenişehir         True    True   True
Yıldırım          True    True   True
İnegöl            True    True   True
İznik             True    True   True

In [413]:
data.value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [414]:
df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [417]:
type(df)   # html files are read as lists by pandas. to see the data as a table you should use list[0]

list

In [436]:
df[0].City.nunique()

427

In [429]:
len(df[0])

556